 &НаСервере
Процедура СкопироватьОтбор(Приемник, Источник, УдалятьПредставлениеГруппы = Ложь, УдалятьНеиспользуемые = Истина, НеВключатьОтборПанелиНавигации = Ложь)
	
	Для каждого ЭлементОтбораИсточник Из Источник.Элементы Цикл
		
		Если УдалятьНеиспользуемые И (Не ЭлементОтбораИсточник.Использование) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НеВключатьОтборПанелиНавигации И ТипЗнч(ЭлементОтбораИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") 
			И ЭлементОтбораИсточник.Представление = "ОтборПанелиНавигации" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ТипЗнч(ЭлементОтбораИсточник) = Тип("ЭлементОтбораКомпоновкиДанных") 
			И ЭлементОтбораИсточник.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поиск") Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементОтбора = Приемник.Элементы.Добавить(ТипЗнч(ЭлементОтбораИсточник));
		ЗаполнитьЗначенияСвойств(ЭлементОтбора, ЭлементОтбораИсточник);
		Если ТипЗнч(ЭлементОтбораИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Если УдалятьПредставлениеГруппы Тогда
				ЭлементОтбора.Представление = "";
			КонецЕсли;
			СкопироватьОтбор(ЭлементОтбора, ЭлементОтбораИсточник);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПланировщик(ДополнительныеПараметры = Неопределено, Результат = Неопределено) Экспорт

	Планировщик.Элементы.Очистить();
	
	ИзмеренияПланировщика   = Планировщик.Измерения;

	ИзмеренияПланировщика.Очистить();

	Запрос = Новый ПостроительЗапроса("ВЫБРАТЬ
	|	Календарь.Регистратор КАК Регистратор,
	|	Календарь.НомерСтроки КАК НомерСтроки,
	|	Календарь.Активность КАК Активность,
	|	Календарь.ДатаВизита КАК ДатаВизита,
	|	Календарь.Статус КАК Статус,
	|	Календарь.Длительность КАК Длительность,
	|	Календарь.Комментарий КАК Комментарий,
	|	Календарь.Клиент КАК Клиент,
	|	Календарь.Мастер КАК Мастер,
	|	Календарь.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.КалендарьЗаписей КАК Календарь
	|ИТОГИ ПО
	|	Мастер
	|	");
	
	Запрос.Выполнить();
	
	ВыборкаМастер = Запрос.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ИзмерениеМастер = ИзмеренияПланировщика.Добавить("Мастер"); 

	Пока ВыборкаМастер.Следующий() Цикл
		
		НовоеИзмерение = ИзмерениеМастер.Элементы.Добавить(ВыборкаМастер.Мастер);
		НовоеИзмерение.Текст = ВыборкаМастер.Мастер; 
		
		Выборка = ВыборкаМастер.Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			ДатаНачала = Выборка.ДатаВизита;
			ДатаОкончания = Выборка.ДатаВизита + Выборка.Длительность * 60;
			
			СоответствиеЗначений = Новый Соответствие; 
			СоответствиеЗначений.Вставить("Мастер",   Выборка.Мастер);
			
			НовыйЭлемент = Планировщик.Элементы.Добавить(ДатаНачала, ДатаОкончания); 
			НовыйЭлемент.Текст = СокрЛП(Выборка.Клиент) + " : " + Выборка.Мастер + " " + Выборка.Услуга + " " + Выборка.Услуга.Длительность + " минут, предварительная стоимость " + Выборка.Услуга.Цена; 
			НовыйЭлемент.Значение = Выборка.Регистратор; 
			Если Выборка.Статус = Перечисления.СтатусыЗаписи.Подтверждена Тогда 
				НовыйЭлемент.ЦветФона  = Новый Цвет(255, 237, 175);
			Иначе
				НовыйЭлемент.ЦветФона  = Новый Цвет(255, 153, 0);
			КонецЕсли;
			НовыйЭлемент.ЦветРамки = WebЦвета.Черный;
			НовыйЭлемент.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений); 
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	УстановитьПредставлениеПериода("Сегодня");
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикЗаписейПередУдалением(Элемент, Отказ)
	
	Если Не Отказ Тогда
		ОчисткаЗаписи(Элемент.ВыделенныеЭлементы[0].Значение);
	КонецЕсли;
	
КонецПроцедуры         

&НаСервере
Процедура ОчисткаЗаписи(Запись)
	
	ДокументОбъект = Запись.ПолучитьОбъект();	
	ДокументОбъект.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПланировщикЗаписейПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Запись = Новый Структура;      
	
	Запись.Вставить("Мастер", ЗначенияИзмерений["Мастер"]); 
	Запись.Вставить("ДатаВизита", Начало); 
	
	ОткрытьФорму("Документ.ЗаписьНаУслугу.Форма.ФормаДокумента", Запись, ЭтотОбъект, , , ,Новый ОписаниеОповещения("ОбновитьПланировщик", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикЗаписейПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;    

	ОткрытьФорму("Документ.ЗаписьНаУслугу.Форма.ФормаДокумента", Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение), ЭтотОбъект, , , ,Новый ОписаниеОповещения("ОбновитьПланировщик", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикЗаписейВыбор(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВариантПериодаПриИзменении(Элемент)
	УстановитьПредставлениеПериода();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеПланировщика()
	
	НачалоРабочегоДня = Константы.НачалоРабочегоДня.Получить();
	ОкончаниеРабочегоДня =  Константы.ОкончаниеРабочегоДня.Получить();
	
	Планировщик.ОтображатьТекущуюДату = Истина;
	Планировщик.ОтступСНачалаПереносаШкалыВремени = НачалоРабочегоДня; 
	Планировщик.ОтступСКонцаПереносаШкалыВремени = ?(ОкончаниеРабочегоДня = 0, 0, 24 - ОкончаниеРабочегоДня); 
	Планировщик.ЕдиницаПериодическогоВарианта   = ТипЕдиницыШкалыВремени.Час; 
	Планировщик.КратностьПериодическогоВарианта = 24;
	Планировщик.ВыравниватьГраницыЭлементовПоШкалеВремени = Ложь;
	Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='дддд, д ММММ гггг'";
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредставлениеПериода(Вариант = Неопределено)
	
	ТекущийПериод = Планировщик.ТекущиеПериодыОтображения[0]; 
	
	Если НЕ ЗначениеЗаполнено(ТекущийПериод.Начало) Тогда 
		ТекущийПериод.Начало = ТекущаяДата();
	КонецЕсли;
	
	Планировщик.ТекущиеПериодыОтображения.Очистить(); 
	
	Если ВариантПериода = "День" Тогда 
		
		Если Вариант = Неопределено Тогда
			ДатаНачала = НачалоДня(ТекущийПериод.Начало);
		ИначеЕсли Вариант = "Назад" Тогда
			ДатаНачала = НачалоДня(ТекущийПериод.Начало) - 60 * 60 * 24;
		ИначеЕсли Вариант = "Вперед" Тогда
			ДатаНачала = НачалоДня(ТекущийПериод.Начало) + 60 * 60 * 24;
		ИначеЕсли Вариант = "Сегодня" Тогда
			ДатаНачала = НачалоДня(ТекущаяДата());
		КонецЕсли;
		
		ДатаОкончания  = КонецДня(ДатаНачала);
		Планировщик.ТекущиеПериодыОтображения.Добавить(ДатаНачала, ДатаОкончания); 
		
		ПредставлениеПериода = Формат(ДатаНачала, "ДФ='дд ММММ'");
		
	ИначеЕсли ВариантПериода = "Неделя" Тогда
		
		Если Вариант = Неопределено Тогда
			ДатаНачала = НачалоНедели(ТекущийПериод.Начало);
		ИначеЕсли Вариант = "Назад" Тогда
			ДатаНачала = НачалоНедели(ТекущийПериод.Начало) - 7 * 60 * 60 * 24;
		ИначеЕсли Вариант = "Вперед" Тогда
			ДатаНачала = НачалоНедели(ТекущийПериод.Начало) + 7 * 60 * 60 * 24;
		ИначеЕсли Вариант = "Сегодня" Тогда
			ДатаНачала = НачалоНедели(ТекущаяДата());
		КонецЕсли;
		
		ДатаОкончания  = КонецНедели(ДатаНачала);
		Планировщик.ТекущиеПериодыОтображения.Добавить(ДатаНачала, ДатаОкончания);
		
		ПредставлениеПериода = СтрШаблон("%1 - %2", Формат(ДатаНачала, "ДФ='дд ММММ'"), Формат(ДатаОкончания, "ДФ='дд ММММ гггг'"));
		
	ИначеЕсли ВариантПериода = "Месяц" Тогда
		
		Если Вариант = Неопределено Тогда
			ДатаНачала = НачалоМесяца(ТекущийПериод.Начало);
		ИначеЕсли Вариант = "Назад" Тогда
			ДатаНачала = ДобавитьМесяц(ТекущийПериод.Начало, -1);
		ИначеЕсли Вариант = "Вперед" Тогда
			ДатаНачала = ДобавитьМесяц(ТекущийПериод.Начало, 1);
		ИначеЕсли Вариант = "Сегодня" Тогда
			ДатаНачала = НачалоМесяца(ТекущаяДата());
		КонецЕсли;
		
		ДатаОкончания  = КонецМесяца(ДатаНачала);
		Планировщик.ТекущиеПериодыОтображения.Добавить(ДатаНачала, ДатаОкончания);
		
		ПредставлениеПериода = ПредставлениеПериода(ДатаНачала, ДатаОкончания);
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	УстановитьПредставлениеПериода("Вперед");
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	УстановитьПредставлениеПериода("Назад");
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	УстановитьПредставлениеПериода("Сегодня");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьПланировщик();
	
	Если НЕ ЗначениеЗаполнено(ВариантПериода) Тогда
		ВариантПериода = "День";
	КонецЕсли;
	
	УстановитьОтображениеПланировщика();   
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикЗаписейНажатиеНаДействиеПланировщика(Элемент, ЭлементПланировщика, Действие)
	Возврат;
КонецПроцедуры


