
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КалендарьЗаписей
	Движения.КалендарьЗаписей.Записывать = Истина;
	Движение = Движения.КалендарьЗаписей.Добавить();
	Движение.Клиент = Клиент;
	Движение.Услуга = Услуга;
	Движение.Мастер = Мастер;
	Движение.ДатаВизита = ДатаВизита;
	Движение.Статус = Статус;
	Движение.Длительность = Длительность;
	Движение.Комментарий = Комментарий;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
