
&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	УстановитьДлительность(Объект.Услуга);
КонецПроцедуры

&НаСервере
Процедура УстановитьДлительность(Услуга)
	Объект.Длительность = Услуга.Длительность;
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Мастер = Параметры.Мастер;
		Объект.Услуга = Параметры.Услуга;
		Объект.ДатаВизита = Параметры.ДатаВизита;
		Объект.Длительность = Параметры.Услуга.Длительность;
		
	КонецЕсли;	
КонецПроцедуры
