
&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	УстановитьДлительность(Объект.Услуга);
КонецПроцедуры

&НаСервере
Процедура УстановитьДлительность(Услуга)
	Объект.Длительность = Услуга.Длительность;
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Мастер = Параметры.Мастер;
		Объект.ДатаВизита = Параметры.ДатаВизита;
	КонецЕсли;	                          
	Элементы.Услуга.СписокВыбора.ЗагрузитьЗначения(УслугиМастера(Объект.Мастер));
КонецПроцедуры

&НаСервере
Функция УслугиМастера(Мастер)
	Возврат Мастер.Услуги.ВыгрузитьКолонку("Услуга");
КонецФункции	                                     

&НаКлиенте
Процедура УслугаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Элементы.Услуга.СписокВыбора.ЗагрузитьЗначения(УслугиМастера(Объект.Мастер));
КонецПроцедуры
