
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ЗакрытиеФормыЗаписи", Запись, ЭтотОбъект.ВладелецФормы);
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	УстановитьДлительность(Запись.Услуга);
КонецПроцедуры

&НаСервере
Процедура УстановитьДлительность(Услуга)
	Запись.Длительность = Услуга.Длительность;
КонецПроцедуры	


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Менеджер =РегистрыСведений.КалендарьЗаписей.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, Запись);
	Менеджер.Прочитать();
	Если Менеджер.Выбран() Тогда
		Менеджер.Удалить();
	КонецЕсли;	   
	Менеджер =РегистрыСведений.КалендарьЗаписей.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, Запись);
	Менеджер.Записать(Истина);
КонецПроцедуры

