Процедура РазослатьУведомления() Экспорт   
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КалендарьЗаписей.Клиент КАК Клиент,
	               |	КалендарьЗаписей.Услуга КАК Услуга,
	               |	КалендарьЗаписей.Мастер КАК Мастер,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КалендарьЗаписей.ДатаВизита) КАК ДатаВизита
	               |ИЗ
	               |	РегистрСведений.КалендарьЗаписей КАК КалендарьЗаписей
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(КалендарьЗаписей.ДатаВизита, ДЕНЬ) = &НачалоДня";
	
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДатаСеанса()+3600*24));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Клиент.НапоминатьОЗаписи Тогда
			ОтправитьСМС(Выборка);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОтправитьСМС(Выборка)
	
КонецПроцедуры	